loadtest.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 20
      name: Sustained load
#  variables:
#  # 변수의 이름은 teamName, 배열 내 원소가 value로서 "{{ $loopElement }}" 에 할당됨
#    teamName:
#      - [a,b,c,d,e,g,h,i,j,k,l,m,o,p,q,r,s,t,u,v,w,x,z,aa,bb,cc,dd,ee,ff,gg,hh,ii,jj,kk,ll,mm,nn,oo,pp,qq,rr,ss,tt,uu]    

scenarios:
  - name: "get latest matches"
    flow:
      - get:
          url: "/reservations/register"

#  - name: "login and createTeams"
#    flow:
#      - loop:
#        - post:
#            headers:
#              authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJsb2dpbklkIjoiaHVsayIsImFjY0tleSI6IjA4ODEiLCJpYXQiOjE2Njk5NDM4MzYsImV4cCI6MTY2OTk0NTYzNn0.rEr3gDyHpPzQrylO0I7CWnq_8m3hYn4BMDMR4gP--RU'
#              Content-Type: 'application/json'
#            url: "/teams"
#            json:
#              teamName: "{{ $loopElement }}"
#              sports: "테니스"
#              member: "5"
#              image: ""
#        over: teamName